TOKEN = '5850018551:AAEihwgsFqq7W7-mSCDQpCfVSuW3v2u8Yb4'
EGOR_ID = 52334269
ADMIN_ID = 94835800
ROMAN_ID = 94835800
ADM_HELLO = 'Вот ваш функционал: '
ADM_BUTT_LIST = [
    'Отметить отсутствующих на трапезе 🍴',
    'Отметить опоздавших на мадриховку 😴',
    'Выдать JAFI-Token\'ы за выполнение активности 🪙',
    'Топ-мадрихов 👑',
    'Дать объявление 📣'
]
ADM_MSGS = ['Выбери по очереди мадрихов, которых не было на трапезе ( как только отметишь всех - нажми "Закончить" в конце списка ): ',
            'Выбери мадрихов, которые опоздали на мадриховку: ',
            'Выбери мадриха, которому хочешь выдать токены за активность: ',
            'Введи количество токенов',
            'Директор начислил JAFI-Token\'ов в количестве {} пользователю под именем {}']
STRT_MSGS = ['''Приветствую тебя мадрих Шевета 2023!
С этого момента ты вступаешь в гонку по добыче 
особой валюты - JAFI-Token\'ов 🪙!
Теперь ты будешь получать токены за различные мадриховские активности''',
'''User Agreement between Telegram Bot User and JAFI Organization

Welcome to the JAFI Telegram Bot (the "Bot"). This User Agreement ("Agreement") is between you and the Jewish Agency for Israel ("JAFI," "we," "us," or "our") and governs your use of the Bot. By accessing or using the Bot, you accept and agree to be bound by the terms and conditions of this Agreement. If you do not agree to the terms and conditions of this Agreement, do not use the Bot.

License to Use the Bot. Subject to your compliance with this Agreement, JAFI grants you a limited, non-exclusive, non-transferable, revocable license to access and use the Bot for your personal, non-commercial use.

Use of the Bot. You may not use the Bot for any unlawful or prohibited purpose, or in any manner that could damage, disable, overburden, or impair the Bot or interfere with any other party's use and enjoyment of the Bot. You may not attempt to gain unauthorized access to the Bot or any accounts, computer systems, or networks connected to the Bot, through hacking, password mining, or any other means.

User Content. You may be able to submit, post, or upload content to the Bot, such as text, images, or videos (collectively, "User Content"). You are solely responsible for your User Content and the consequences of posting or publishing it. By posting User Content, you represent and warrant that: (a) you are the owner of the User Content or have the necessary rights and permissions to use it; (b) the User Content is accurate and not misleading; and (c) the use of the User Content does not violate this Agreement and will not infringe upon the rights of any third party.

Intellectual Property. The Bot and all content and materials included on the Bot, including but not limited to text, graphics, logos, images, and software, are the property of JAFI or its licensors and are protected by copyright and trademark laws. You may not use any content or materials on the Bot for any commercial purpose without the express written consent of JAFI.

Disclaimer of Warranties. The Bot is provided on an "as is" and "as available" basis. JAFI makes no representations or warranties of any kind, express or implied, as to the operation of the Bot or the information, content, materials, or products included on the Bot. JAFI will not be liable for any damages of any kind arising from the use of the Bot, including but not limited to direct, indirect, incidental, punitive, and consequential damages.

Indemnification. You agree to indemnify and hold JAFI and its affiliates, officers, agents, and employees harmless from any claim or demand, including reasonable attorneys' fees, made by any third party due to or arising out of your use of the Bot, your violation of this Agreement, or your violation of any rights of another.

Termination. JAFI reserves the right, in its sole discretion, to terminate your access to the Bot and the related services or any portion thereof at any time, without notice.
Governing Law. This Agreement and your use of the Bot will be governed by and construed in accordance with the laws of the State of Israel, without giving effect to any principles of conflicts of law.
Changes to this Agreement. JAFI reserves the right, in its sole discretion, to change, modify, add, or delete portions of this Agreement at any time.
''',
'''Перед тем как начать - напиши своё Имя и Фамилию
( Отправляя своё имя вы соглашаетесь на участие в данной активности и соглашаетесь с пользовательским соглашением )''']

MENU_MSG = 'Добро пожаловать в систему учётов JAFI-Token\'ов на лагере Шевет 2023!'
MON_MSG = 'Ниже представлен список активностей, за которые ты будешь получать токены: '
MENU = ['Заработать 💰',
        'Потратить 🧾',
        'Топ-мадрихов 👑',
        'Мой баланс 🪙',
        'FAQ']
FAQ = '''
Дорогие мадрихи, данный бот был создан исключительно для вас. 
У каждого есть возможность честным трудом заработать неопределенное количество мадриховских токенов и потратить их на ваши нужды.

В главном меню вы можете наблюдать 4 раздела:

1 - Заработать ТОКЕНЫ - это меню, в котором можно ознакомиться со всеми способами, которые позволяют зарабатывать ТОКЕНЫ

2 - Потратить ТОКЕНЫ - это меню, в котором на заработанные вами ТОКЕНЫ - вы можете покупать те или иные вещи 

3 - Топ Т-МАДРИХОВ - это список самых богатых мадрихов за всю историю, которые сумели. Вне зависимости от траты токенов - бот высчитывает общее количество заработанных вами токенов за все время.

4 - Мой баланс - это количество токенов которые у вас есть на данный момент, с каждой покупкой - ваши ТОКЕНЫ тратятся, либо с каждым заработком - прибавляются.
'''
DESCRIPTIONS = [
    'Если вы проснетесь вовремя и не проспите вы получите 1 🪙',
    'За каждый прием пищи с утра вы получаете 2 🪙',
    'За каждый приход на мадриховку без опаздания вы получаете 5 🪙',
    'Сделайте начало дня своих коллег лучше - пожелайте каждому доброго утра и продуктивного дня и получите 1 🪙',
    'За каждое проведение Бокер Това вы получаете 10 🪙',
    'За каждое проведенное групповое занятие вы получаете 1 🪙',
    'За каждый прием пищи в обед вы получаете 2 🪙',
    'За каждую проведенную опцию вы получаете 5 🪙',
    'За каждое проведенное занятие мастерской вы получаете 1 🪙',
    'Если вы навели порядок на складе вы получаете 10 🪙',
    'За каждый прием пищи вечером вы получаете 2 🪙',
    'Если вы навели порядок в мадриховке, убрали весь мусор и подготовили рабочее пространство вы получаете 10 🪙',
    'Придите на помощь вечмерщикам и помогите подготовить помещение и получите 10 🪙',
    'За каждую отыгранную роль на лагере вы получаете 10 🪙',
    'За каждое проведение вечернего мероприятия вы получаете 8 🪙',
    'За каждое дежурство вы получаете 1 🪙',
]
POS_MSG = 'Здесь ты можешь ознакомиться со всеми доступными позициями и их ценами. Твой баланс на данный момент составляет {} JAFI-Token\'(a\\ов).\nПри нажатии на позицию вы её приобретёте, если на вашем счету достоточный баланс.'
POSITIONS = [
'Уйти пораньше спать\n50🪙',
'Повесить мой портрет в мадриховке\n15🪙',
'Стикер-пак от директора\n10🪙' ,
'Пачка доширака\n30🪙',
'Жевательная резинка Orbit\n25🪙',
'Энергетический напиток Flash\n60🪙',
'Пропустить дежурство\n150🪙',
'Кофе с утра в номер\n60🪙',
'Заказать песню на Бокер-Тов\n20🪙',
'Перекур во время мадриховки\n25🪙',
'Наставление по жизни от цевета\n15🪙',
'Провести мадриховку на природе\n15🪙',
'Ночной променад со всем цеветом\n100🪙',
'Пропустить дежурство по мадриховке\n150🪙',
'Пойти спать во время свободного времени\n150🪙',
'Стать директором на день\n1000🪙',
'Назвать мадриховку в мою честь\n100🪙',
'Забронировать удобное кресло в мадриховке\n15🪙',
'Получить комплимент от каждого из мадрихов\n15🪙',
'Организовать пост-кемп\n🪙800',
'Провести мой день рождения сегодня\n🪙300',
'Стать администратором группы в телеграме\n🪙100',
'Фотосессия от фотографа\n100🪙',
'Получить чайный набор в номер\n200🪙',
'Получить мерч следующего лагеря\n500🪙',
'Горячее какао\n50🪙',
'Моя фотография на рабочем столе\n80🪙',
'Получить значок для одежды/рюкзака\n20🪙',
'Получить майку прошлого мерча\n150🪙',
'Поговорить с Дядей Тимуром по душам\n700🪙',
'Получить совет от Дяди Тимура\n500🪙',
'Получить банку узбекского пива\n150🪙',
'Получить разрешение на распитие банки пива\n200🪙',
'Получить канволюту валерьянки\n15🪙',
'Замерить мое давление\n🪙5',
'Назвать следующий лагерь в мою честь\n2000🪙'
]

BUYING = ['На вашем балансе не хватает средств. Вам необходимо ещё {} JAFI-Token\'ов для преобретения этой позиции',
          'Поздравляю! Покупка произошла успешно! Все пользователи бота получат сообщение, о приобретённой вами позиции.',
          '{} приобрёл позицию: "{}"']